Revit 2024 API
ProjectPosition Members
The ProjectPosition type exposes the following members.
Constructors
Name | Description
ProjectPosition(ProjectPosition)
 Creates a copy of the ProjectPosition.
ProjectPosition(Double, Double, Double, Double)
 Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation.
Methods
Name | Description
Dispose
Releases all resources used by the ProjectPosition
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Angle
 Angle from True North.
EastWest
 East/West offset.
Elevation
 Elevation above ground level.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NorthSouth
 North/South offset
See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace